:PROPERTIES:
:ID:       fba317bd-8a90-48e9-b8aa-fdf98f9e0001
:END:
#+title: MySQL Practical 5
#+author: pspiagicw
#+date: <2021-10-18 Mon>
#+property: header-args:sql :dhhost 127.0.0.1 :engine mysql :dbpassword shrgooglegithub :database shit :resutls output
* Practical 5
  #+begin_src sql
show tables;
  #+end_src

  #+RESULTS:
  | Tables_in_shit |
  |----------------|
  | computers      |
  | example        |
  | os             |
  | people         |
  | programmers    |
  | sample         |
  

  #+begin_src sql
create table classes ( subject varchar(25) , year int , faculty varchar(25) );

  #+end_src


  #+begin_src sql
select * from classes;

  #+end_src
  #+begin_src sql
insert into classes values ( 'English' , 1 , 'Deepak');
insert into classes values ( 'English' , 1 , 'Rachel');
insert into classes values ( 'English' , 1 , 'Ross');
insert into classes values ( 'English' , 2 , 'Rahul');
insert into classes values ( 'English' , 2 , 'Prahav');
insert into classes values ( 'Sanskrit' , 1 , 'Narendra');
insert into classes values ( 'Sanskrit' , 1 , 'David');
  #+end_src

  #+RESULTS:
  |---|

  #+begin_src sql
select * from classes;
  #+end_src

  #+RESULTS:
  | subject  | year | faculty  |
  |----------+------+----------|
  | English  |    1 | Deepak   |
  | English  |    1 | Rachel   |
  | English  |    1 | Ross     |
  | English  |    2 | Rahul    |
  | English  |    2 | Prahav   |
  | Sanskrit |    1 | Narendra |
  | Sanskrit |    1 | David    |

  #+begin_src sql
select subject ,year , count(*) from classes group by year,subject;
  #+end_src

  #+RESULTS:
  | subject  | year | count(*) |
  |----------+------+----------|
  | English  |    1 |        3 |
  | Sanskrit |    1 |        2 |
  | English  |    2 |        2 |

  #+begin_src sql
alter table classes add column credits int;
  #+end_src


  #+begin_src sql
desc classes;
  #+end_src

  #+RESULTS:
  | Field   | Type        | Null | Key | Default | Extra |
  |---------+-------------+------+-----+---------+-------|
  | subject | varchar(25) | YES  |     | NULL    |       |
  | year    | int(11)     | YES  |     | NULL    |       |
  | faculty | varchar(25) | YES  |     | NULL    |       |
  | credits | int(11)     | YES  |     | NULL    |       |


  #+begin_src sql
create table employees ( name varchar(25) , salary int , age int);
  #+end_src


  #+begin_src sql
insert into employees values ( 'Ashish' , 1000 , 19);
insert into employees values ( 'Kiran' , 2000 , 20);
insert into employees values ( 'Ashish' , 500 , 19);
insert into employees values ( 'Kiran' , 1000 , 20);
insert into employees values ( 'Dani' , 1000 , 18);
  #+end_src


  #+begin_src sql
select * from employees;
  #+end_src

  #+RESULTS:
  | name   | salary | age |
  |--------+--------+-----|
  | Ashish |   1000 |  19 |
  | Kiran  |   2000 |  20 |
  | Ashish |    500 |  19 |
  | Kiran  |   1000 |  20 |
  | Dani   |   1000 |  18 |

  #+begin_src sql
select name , sum(salary) from employees group by salary having sum(salary) >= 2000;
  #+end_src

  #+RESULTS:
  | name   | sum(salary) |
  |--------+-------------|
  | Ashish |        3000 |
  | Kiran  |        2000 |

